
#include "my_user_interface/UserInterface.h"

//SFL

//TODO Прогнать через валгринд, убедиться в том, что пустые узлы освобождаются
//TODO Дописать в грамматику функции (математические)
//TODO Файл с синтаксисом
//TODO Добавить операций для дифференциатора и ассемблера
//TODO Проверку чтобы имя функции не начиналось с $ а имя переменной
//TODO Комменты в моем языке
//TODO Скобки у математических выражений в фронт-1
//TODO Токенизация из своего языка
//TODO Перегруппировать папки
//TODO Скинуть системные файлы в отдельную папку

int main () {
	UserInterfaceMain ();
    return 0;
}
